[
  {
    "id": "1",
    "title": "JavaScript from beginner to Professional",
    "thumbnail": "https://content.packt.com/B16682/cover_image_small.png",
    "author": "Laurence Lars Svekis",
    "category": "Programming",
    "description": "This book demonstrates the capabilities of JavaScript for web application development by combining theoretical learning with code exercises and fun projects that you can challenge yourself with. The guiding principle of the book is to show how straightforward JavaScript techniques can be used to make web apps ranging from dynamic websites to simple browser-based games. JavaScript from Beginner to Professional focuses on key programming concepts and Document Object Model manipulations that are used to solve common problems in professional web applications. These include data validation, manipulating the appearance of web pages, working with asynchronous and concurrent code. The book uses project-based learning to provide context for the theoretical components in a series of code examples that can be used as modules of an application, such as input validators, games, and simple animations. This will be supplemented with a brief crash course on HTML and CSS to illustrate how JavaScript components fit into a complete web application. As you learn the concepts, you can try them in your own editor or browser console to get a solid understanding of how they work and what they do. By the end of this JavaScript book, you will feel confident writing core JavaScript code and be equipped to progress to more advanced libraries, frameworks, and environments such as React, Angular, and Node.js.",
    "price": 36.99,
    "chapters": [
      "Getting Started with JavaScript",
      "JavaScript Essentials",
      "JavaScript Multiple Values",
      "Logic Statements",
      "Loops",
      "Functions",
      "Classes",
      "Built-In JavaScript Methods",
      "The Document Object Model",
      "Dynamic Element Manipulation Using the DOM",
      "Interactive Content and Event Listeners",
      "Intermediate JavaScript",
      "Concurrency",
      "HTML5, Canvas, and JavaScript",
      "Next Steps",
      "Other Books You May Enjoy",
      "Index"
    ]
  },
  {
    "id": "2",
    "title": "Angular Projects - Third Edition",
    "thumbnail": "https://content.packt.com/B18465/cover_image_small.jpg",
    "author": "Aristeidis Bampakos",
    "category": "Web Development",
    "description": "Angular Projects isn't like other books on Angular – this is a project-based guide that helps budding Angular developers get hands-on experience while developing cutting-edge applications. In this updated third edition, you’ll master the essential features of the framework by creating ten different real-world web applications. Each application will demonstrate how to integrate Angular with a different library and tool, giving you a 360-degree view of what the Angular ecosystem makes possible. Updated to the newest version of Angular, the book has been revamped to keep up with the latest technologies. You’ll work on a PWA weather application, a mobile photo geotagging application, a component UI library, and other exciting projects. In doing so, you’ll implement popular technologies such as Angular Router, Scully, Electron, Angular service workers, Jamstack, NgRx, and more. By the end of this book, you will have the skills you need to build Angular apps using a variety of different technologies according to your or your client’s needs.",
    "price": 41.99,
    "chapters": [
      "Creating Your First Web Application in Angular",
      "Building an SPA Application with Scully and Angular Router",
      "Building an Issue Tracking System Using Reactive Forms",
      "Building a PWA Weather Application Using Angular Service Worker",
      "Building a WYSIWYG Editor for the Desktop Using Electron",
      "Building a Mobile Photo Geotagging Application Using Capacitor and 3D Maps",
      "Building an SSR Application for a GitHub Portfolio Using Angular",
      "Building an Enterprise Portal Using Nx Monorepo Tools and NgRx",
      "Building a Component UI Library Using Angular CLI and Angular CDK",
      "Customizing Angular CLI Commands Using Schematics",
      "Other Books You May Enjoy",
      "Index"
    ]
  },
  {
    "id": "3",
    "title": "Reactive Patterns with RxJS for Angular",
    "thumbnail": "https://content.packt.com/B17797/cover_image_small.jpeg",
    "author": "Lamis Chebbi",
    "category": "Web Development",
    "description": "RxJS is a fast, reliable, and compact library for handling asynchronous and event-based programs. It is a first-class citizen in Angular and enables web developers to enhance application performance, code quality, and user experience, so using reactive patterns in your Angular web development projects can improve user interaction on your apps, which will significantly improve the ROI of your applications. This book is a step-by-step guide to learning everything about RxJS and reactivity. You'll begin by understanding the importance of the reactive paradigm and the new features of RxJS 7. Next, you'll discover various reactive patterns, based on real-world use cases, for managing your application’s data efficiently and implementing common features using the fewest lines of code. As you build a complete application progressively throughout the book, you'll learn how to handle your app data reactively and explore different patterns that enhance the user experience and code quality, while also improving the maintainability of Angular apps and the developer's productivity. Finally, you'll test your asynchronous streams and enhance the performance and quality of your applications by following best practices. By the end of this RxJS Angular book, you'll be able to develop Angular applications by implementing reactive patterns.",
    "price": 54.99,
    "chapters": [
      "Part 1 – Introduction",
      "Chapter 1: The Power of the Reactive Paradigm",
      "Chapter 2: RxJS 7 – The Major Features",
      "Chapter 3: A Walkthrough of the Application",
      "Part 2 – A Trip into Reactive Patterns",
      "Chapter 4: Fetching Data as Streams",
      "Chapter 5: Error Handling",
      "Chapter 6: Combining Streams",
      "Chapter 7: Transforming Streams",
      "Part 3 – Multicasting Takes You to New Places",
      "Chapter 8: Multicasting Essentials",
      "Chapter 9: Caching Streams",
      "Chapter 10: Sharing Data between Components",
      "Chapter 11: Bulk Operations",
      "Chapter 12: Processing Real-Time Updates",
      "Part 4 – Final Touch",
      "Chapter 13: Testing RxJS Observables",
      "Other Books You May Enjoy"
    ]
  },
  {
    "id": "4",
    "title": "Essential Cryptography for JavaScript Developers",
    "thumbnail": "https://content.packt.com/B17148/cover_image_small.png",
    "author": "Alessandro Segala",
    "category": "Security",
    "description": "If you’re a software developer, this book will give you an introduction to cryptography, helping you understand how to make the most of it for your applications. The book contains extensive code samples in JavaScript, both for Node.js and for frontend apps running in a web browser, although the core concepts can be used by developers working with any programming language and framework. With a purely hands-on approach that is focused on sharing actionable knowledge, you’ll learn about the common categories of cryptographic operations that you can leverage in all apps you’re developing, including hashing, encryption with symmetric, asymmetric and hybrid ciphers, and digital signatures. You’ll learn when to use these operations and how to choose and implement the most popular algorithms to perform them, including SHA-2, Argon2, AES, ChaCha20-Poly1305, RSA, and Elliptic Curve Cryptography. Later, you’ll learn how to deal with password and key management. All code in this book is written in JavaScript and designed to run in Node.js or as part of frontend apps for web browsers. By the end of this book, you'll be able to build solutions that leverage cryptography to protect user privacy, offer better security against an expanding and more complex threat landscape, help meet data protection requirements, and unlock new opportunities.",
    "price": 33.99,
    "chapters": [
      "Part 1 – Getting Started",
      "Chapter 1: Cryptography for Developers",
      "Chapter 1: Cryptography for Developers",
      "What is cryptography and why should a developer care?",
      "Chapter 2: Dealing with Binary and Random Data",
      "Part 2 – Using Common Cryptographic Operations with Node.js",
      "Chapter 3: File and Password Hashing with Node.js",
      "Chapter 4: Symmetric Encryption in Node.js",
      "Chapter 5: Using Asymmetric and Hybrid Encryption in Node.js",
      "Chapter 6: Digital Signatures with Node.js and Trust",
      "Part 3 – Cryptography in the Browser",
      "Chapter 7: Introduction to Cryptography in the Browser",
      "Chapter 8: Performing Common Cryptographic Operations in the Browser",
      "Other Books You May Enjoy"
    ]
  },
  {
    "id": "5",
    "title": "Mastering Go - Third Edition",
    "thumbnail": "https://content.packt.com/B17194/cover_image_small.jpeg",
    "author": "Mihalis Tsoukalos",
    "category": "Programming",
    "description": "Mastering Go is the essential guide to putting Go to work on real production systems. This freshly updated third edition includes topics like creating RESTful servers and clients, understanding Go generics, and developing gRPC servers and clients. Mastering Go was written for programmers who want to explore the capabilities of Go in practice. As you work your way through the chapters, you’ll gain confidence and a deep understanding of advanced Go concepts, including concurrency and the operation of the Go Garbage Collector, using Go with Docker, writing powerful command-line utilities, working with JavaScript Object Notation (JSON) data, and interacting with databases. You’ll also improve your understanding of Go internals to optimize Go code and use data types and data structures in new and unexpected ways. This essential Go programming book will also take you through the nuances and idioms of Go with exercises and resources to fully embed your newly acquired knowledge. With the help of Mastering Go, you’ll become an expert Go programmer by building Go systems and implementing advanced Go techniques in your projects.",
    "price": 57.99,
    "chapters": [
      "A Quick Introduction to Go",
      "Basic Go Data Types",
      "Composite Data Types",
      "Reflection and Interfaces",
      "Go Packages and Functions",
      "Telling a UNIX System What to Do",
      "Go Concurrency",
      "Building Web Services",
      "Working with TCP/IP and WebSocket",
      "Working with REST APIs",
      "Code Testing and Profiling",
      "Working with gRPC",
      "Go Generics",
      "Other Books You May Enjoy",
      "Index"
    ]
  }
]
